// String 빌트인 객체는 문자열을 다룰 때 유용한 프로퍼티와 메소드를 제공한다.

// 사용법은 다른 빌트인 객체와 동일하게 new 연산자를 사용하여 인스턴스를 생성한다.
// Array와 마찬가지로 indexOf, slice, length 등의 프로퍼티와 메소드를 사용할 수 있다.

// 메서드를 나열하기 보다는 Array와 String을 비교하며 느낀저점을 적어보도록 하겠다.

/*
Array 객체는 데이터를 순서대로 저장할 수 있다는 장점이 있다.
또한, Array 객체는 다양한 메서드와 속성을 제공하여 데이터를 쉽게 처리할 수 있다.

String 객체는 데이터를 문자열로 저장할 수 있다는 장점이 있다.
또한, Array 객체와 달리 순서가 없기 때문에 데이터를 순서대로 처리할 수 없다는 점이 있는데, 단점이자 장점같다.

따라서, Array 객체와 String 객체 중 어느 객체를 사용할지는 데이터의 특성에 따라 다르다.
만약, 데이터를 순서대로 저장하고, 다양한 메서드와 속성을 사용하여 데이터를 처리해야 한다면 Array 객체를 사용하는 것이 좋고
 정규식이 필요하거나 문자열의 길이와 구조를 변경할 필요가 없는 경우 String 객체를 사용하는 것이 좋을 것 같다.
*/